[
    {
        "type": "text-title",
        "value": "$ whoami"
    },
    {
        "type": "text",
        "value": "My name is Kristóf Kékesi. I'm a 18 years old Hungarian programmer. I'm currently studing in a Hungarian high school near Budapest, from where I will be graduating in <a class='target' href='../timeline#2023'>2023</a> as a math and <abbr class='target' title='' customtitle='Computer Science'>CS</abbr> major."
    },
    {
        "type": "text-title",
        "value": "Previously"
    },
    {
        "type": "text-subtitle",
        "value": "Web Development"
    },
    {
        "type": "text",
        "value": "I started learning web development in <a class='target' href='../timeline#2018'>2018</a>. Since then I tried myself in other platforms as well."
    },
    {
        "type": "text",
        "value": "<a class='target' href='../timeline#2020'>2020</a> was the first year I took programming seriosly. I started making my porfolio site where I could display my projects. For that I bought this domain. The site was never really finished, so I rewrote the entire site from ground up using React and JavaScript."
    },
    {
        "type": "article-preview-smoll",
        "articleIDs": [1]
    },
    {
        "type": "text-subtitle",
        "value": "Mobile Development"
    },
    {
        "type": "text",
        "value": "After I learnt the basics of the web I started making apps for mobiles. In <a class='target' href='../timeline#2020'>2020</a> I'we released several mobile apps including Elements and NASA Mira. For now I only know Flutter, but in the future I would like to learn Swift and Kotlin."
    },
    {
        "type": "article-preview-smoll",
        "articleIDs": [2]
    },
    {
        "type": "text-title",
        "value": "As for the future"
    },
    {
        "type": "text-subtitle",
        "value": "Web Development"
    },
    {
        "type": "text",
        "value": "I'm planning to make Preacher available for the users of the web. For this project I'm planning to use Vue.js or Ruby on Rails."
    },
    {
        "type": "text",
        "value": "For a future yet nameless project I'm planning to use Next.js, Tailwind CSS for building and Vercel for hosting it."
    },
    {
        "type": "text-subtitle",
        "value": "Mobile Development"
    },
    {
        "type": "text",
        "value": "Next year I want to learn Kotlin as I will be building a simple Android app with it. For this project I'm planning to use Supabase for cloud storage."
    },
    {
        "type": "text",
        "value": "I would like to learn Swift with UIKit and SwiftUI which, however this is not certain since I don't have a Mac yet (Waiting for the M1X MacBook Pro)."
    },
	{
		"type": "project-bundle",
		"id": 1
	}
]
